change: architecture, readme
